app/views/comments/_form.html.erb

SELECT `users`.* FROM `users`
---
    <%= f.label :user %><br />
    <%= f.select :user_id, options_for_select(User.all.map{ |s| [s.username] })   %>

SELECT `hotels`.* FROM `hotels`
---
    <%= f.label :hotel %><br />
    <%= f.select :hotel_id, options_for_select(Hotel.all.map{ |s| [s.name, s.id] }) %>