app/views/booked_rooms/_form.html.erb

SELECT `rooms`.* FROM `rooms`
---
    <%= f.label :room %><br />
    <%= f.select :room_id, options_for_select(Room.all.map{ |s| [s.id] }) %>

SELECT `hotels`.* FROM `hotels`
---
    <%= f.label :hotel %><br />
    <%= f.select :hotel_id, options_for_select(Hotel.all.map{ |s| [s.name, s.id] }) %>