app/views/hotel_pics/_form.html.erb

    <%= f.label :hotel %><br />
    <%= f.select :hotel_id, options_for_select(Hotel.all.map{ |s| [s.name, s.id] }) %>
---
SELECT `hotels`.* FROM `hotels`