app/views/rooms/_form.html.erb

SELECT `hotels`.* FROM `hotels`
---
    <%= f.label :hotel %><br />
    <%=  f.select :hotel_id, options_for_select(Hotel.all.map{ |s| [s.name, s.id] }) %>