app/controllers/booked_rooms_controller.rb

SELECT `booked_rooms`.* FROM `booked_rooms`
---
  def index
    @booked_rooms = BookedRoom.all

SELECT  `booked_rooms`.* FROM `booked_rooms`  WHERE `booked_rooms`.`id` = 1 LIMIT 1
SELECT  `rooms`.* FROM `rooms`  WHERE `rooms`.`id` = 1 LIMIT 1
---
  def show
    @booked_room = BookedRoom.find(params[:id])

SELECT  `booked_rooms`.* FROM `booked_rooms`  WHERE `booked_rooms`.`id` = 1 LIMIT 1
---
  def edit
    @booked_room = BookedRoom.find(params[:id])

INSERT INTO `booked_rooms` (`created_at`, `from_date`, `hotel_id`, `quantity`, `room_id`, `to_date`, `updated_at`) VALUES ('2014-05-21 16:55:15', '2014-05-22', 1, 1, 1, '2014-05-28', '2014-05-21 16:55:15')
---
  def book


    if  session[:from_date] && session[:to_date]

	from_date = DateTime.parse(session[:from_date]).to_date.to_s
	to_date = DateTime.parse(session[:to_date]).to_date.to_s
    	puts "in loop"
	params.each do |key, value|
		puts key
	   # target groups using regular expressions
	      if ( (key =~ /[0-9]+\z/) == 0 )
		puts "i am herrreeeee"
		room = { room_id:key.to_f , hotel_id:params[:id] , quantity:value.to_f , from_date:from_date , to_date:to_date }
		booking = BookedRoom.new(room)
		booking.save