app/controllers/comments_controller.rb

  def add

    comment_param = { hotel_id:params[:id] ,head:params[:head] ,rating:params[:rating].to_f ,body:params[:body] ,user_id:session['warden.user.user.key'][0][0].to_f }

    comment = Comment.new(comment_param)

    hotel = Hotel.find(params[:id])

    #recalculating average rating

    hotel_rating = (hotel.rating + params[:rating].to_f) / (hotel.votes + 1)

    section = { rating:hotel_rating , votes:(hotel.votes + 1) }

    if hotel.update_attributes(section)


    	      if comment.save
---
SELECT  `hotels`.* FROM `hotels`  WHERE `hotels`.`id` = 1 LIMIT 1
UPDATE `hotels` SET `rating` = 7, `updated_at` = '2014-05-21 21:36:31', `votes` = 1 WHERE `hotels`.`id` = 1
INSERT INTO `comments` (`body`, `created_at`, `head`, `hotel_id`, `rating`, `updated_at`, `user_id`) VALUES ('I had the best time at this hotel had great fun and my kids were over the moon playing in their awesome poooool!!!', '2014-05-21 21:36:31', 'What an amazing Journey!!', 1, 4, '2014-05-21 21:36:31', 1)