app/controllers/hotels_controller.rb

  def index
    @hotels = Hotel.all
---
SELECT `hotels`.* FROM `hotels`

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT  `hotels`.* FROM `hotels`  WHERE `hotels`.`id` = 1 LIMIT 1

  def view

	puts session.inspect
    # you should get these dates from sessions
    from_date = DateTime.parse("2014/5/22").to_date.to_s
    to_date = DateTime.parse("2014/5/28").to_date.to_s
    #range = (from_date)..to_date

    session[:from_date] = "2014/5/22"
    session[:to_date] = "2014/5/28"

    @hotel = Hotel.find(params[:id])
    @hotel_pics = HotelPic.where(hotel_id:params[:id])
    rooms1 = Room.select("rooms.id,rooms.room_type,rooms.price,rooms.avatar,rooms.descs,(rooms.quantity - sum(booked_rooms.quantity)) as rooms_left").joins(:booked_rooms).where("rooms.hotel_id = ? and from_date between ? and ? OR to_date between ? and ?",params[:id],from_date,to_date,from_date,to_date)
    rooms2 = Room.where("hotel_id = ?",params[:id])
    @rooms = rooms1 | rooms2
    @comments = User.select("comments.head,comments.body,comments.rating,users.email").joins(:comments).where("comments.hotel_id = ?",params[:id])
---
SELECT  `hotels`.* FROM `hotels`  WHERE `hotels`.`id` = 1 LIMIT 1
SELECT `hotel_pics`.* FROM `hotel_pics`  WHERE `hotel_pics`.`hotel_id` = 1
SELECT rooms.id,rooms.room_type,rooms.price,rooms.avatar,rooms.descs,(rooms.quantity - sum(booked_rooms.quantity)) as rooms_left FROM `rooms` INNER JOIN `booked_rooms` ON `booked_rooms`.`room_id` = `rooms`.`id` WHERE (rooms.hotel_id = '1' and from_date between '2014-05-22' and '2014-05-28' OR to_date between '2014-05-22' and '2014-05-28')
SELECT `rooms`.* FROM `rooms`  WHERE (hotel_id = '1')
SELECT comments.head,comments.body,comments.rating,users.username FROM `users` INNER JOIN `comments` ON `comments`.`user_id` = `users`.`id` WHERE (comments.hotel_id = '1')

  def edit
    @hotel = Hotel.find(params[:id])
---
SELECT  `hotels`.* FROM `hotels`  WHERE `hotels`.`id` = 1 LIMIT 1

  def create
    @hotel = Hotel.new(hotel_params)

    respond_to do |format|
      if @hotel.save
---
INSERT INTO `hotels` (`avatar`, `city`, `country`, `created_at`, `desc`, `name`, `rating`, `updated_at`) VALUES ('29328808.jpg', 'koh Samui', 'Thailand', '2014-05-20 14:10:29', 'Overlooking its private beach along the Red Sea, this 5-star resort has spacious suites with a private terrace. It features an outdoor pool, a spa, and 3 restaurants.\r\n\r\nA walk-in closet and a flat-screen satellite TV are in Oberoi’s air-conditioned suites. Each includes free Wi-Fi, a glass-walled bathroom with a marble bath and separate shower. Some include a pool on the grounds and iPod docking stations.\r\n\r\nMassages and various beauty treatments, including exfoliating scrubs, are provided at Oberoi Sahl’s spa. It includes private steam rooms and a gym fitted with Life Fitness equipment. Other activities include stargazing, a cooking class, yoga and aromatherapy.\r\n\r\nOriental, Indian, and international cuisine are served at Hasheesh’s restaurants. The main restaurant offers panoramic views of the beach and the Red Sea. Drinks, light snacks, and cigars are available at the pool bar.\r\n\r\nHurghada’s shopping center and airport are a 25-minute drive from The Oberoi Sahl Hasheesh. The 24-hour front desk staff can arrange snorkeling trips and car rentals for guests.', 'Nai biang Beach Hotel', 3, '2014-05-20 14:10:29')

  def update
    @hotel = Hotel.find(params[:id])

    respond_to do |format|
      if @hotel.update_attributes(hotel_params)
---
SELECT  `hotels`.* FROM `hotels`  WHERE `hotels`.`id` = 1 LIMIT 1
UPDATE `hotels` SET `avatar` = '29328808.jpg', `updated_at` = '2014-05-20 21:42:52' WHERE `hotels`.`id` = 1