app/controllers/hotel_pics_controller.rb

SELECT `hotel_pics`.* FROM `hotel_pics`
---
  def index
    @hotel_pics = HotelPic.all

SELECT  `hotel_pics`.* FROM `hotel_pics`  WHERE `hotel_pics`.`id` = 1 LIMIT 1
---
  def show
    @hotel_pic = HotelPic.find(params[:id])

SELECT  `hotel_pics`.* FROM `hotel_pics`  WHERE `hotel_pics`.`id` = 1 LIMIT 1
---
  def edit
    @hotel_pic = HotelPic.find(params[:id])

INSERT INTO `hotel_pics` (`avatar`, `created_at`, `hotel_id`, `updated_at`) VALUES ('18260930.jpg', '2014-05-20 14:31:09', 1, '2014-05-20 14:31:09')
---
  def create
    @hotel_pic = HotelPic.new(hotel_pic_params)

    respond_to do |format|
      if @hotel_pic.save

SELECT  `hotel_pics`.* FROM `hotel_pics`  WHERE `hotel_pics`.`id` = 1 LIMIT 1
UPDATE `hotel_pics` SET `avatar` = '1561876.jpg', `updated_at` = '2014-05-20 21:43:35' WHERE `hotel_pics`.`id` = 1
---
  def update
    @hotel_pic = HotelPic.find(params[:id])

    respond_to do |format|
      if @hotel_pic.update_attributes(hotel_pic_params)