app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
---
SELECT `rooms`.* FROM `rooms`

  def show
    @room = Room.find(params[:id])
---
SELECT  `rooms`.* FROM `rooms`  WHERE `rooms`.`id` = 1 LIMIT 1

  def edit
    @room = Room.find(params[:id])
---
SELECT  `rooms`.* FROM `rooms`  WHERE `rooms`.`id` = 1 LIMIT 1

  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save
---
INSERT INTO `rooms` (`avatar`, `created_at`, `descs`, `hotel_id`, `price`, `quantity`, `room_type`, `updated_at`) VALUES ('18261052.jpg', '2014-05-20 14:21:34', 'Air Conditioning , hot / cold water , sea side view , Plasma TV', 1, 3600, 10, 'Double', '2014-05-20 14:21:34')

  def update
    @room = Room.find(params[:id])

    respond_to do |format|
      if @room.update_attributes(room_params)
---
SELECT  `rooms`.* FROM `rooms`  WHERE `rooms`.`id` = 1 LIMIT 1
UPDATE `rooms` SET `avatar` = '11412497.jpg', `updated_at` = '2014-05-20 21:45:38' WHERE `rooms`.`id` = 1